Revit 2027 API
BuiltInFailures.CutFailures.CannotCutGeometry Property
 Elements do not intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutGeometry { get; }
Public Shared ReadOnly Property CannotCutGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutGeometry {
	FailureDefinitionId^ get ();
}
static member CannotCutGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace